plan:

```
Terraform will perform the following actions:

  # aws_cloudfront_response_headers_policy.response_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "response_policy" {
      + comment = "Policy for RustcPerf website"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "RustcPerfPolicy"

      + security_headers_config {
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "no-referrer"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 63072000
              + override                   = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # module.static_website.aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
      ~ http_version                   = "http2" -> "http2and3"
        id                             = "E355NZKQL79WTL"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      ~ viewer_certificate {
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with aws_s3_bucket.bucket,
│   on s3.tf line 90, in resource "aws_s3_bucket" "bucket":
│   90: resource "aws_s3_bucket" "bucket" {
│
│ Use the aws_s3_bucket_versioning resource instead
│
│ (and 5 more similar warnings elsewhere)
╵
```